{"items":[{
    "id": "248",
    "title": "What is Cyber Crime? Category, Cyber Crime under IPC.",
    "content": "<p>Cyber Crime is a &nbsp;generic term that refer to all he criminal activities done using medium of communication technology , &nbsp;Internet, World wide web and cyber space. It is also known as computer oriented crime. A cybercriminal may use a device to access a user’s personal information, confidential business information, government information, or disable a device. It is also a cybercrime to sell or elicit the above information online.<\/p><h4>Crime in Context of Internet<\/h4><p>Internet crime is any crime or illegal online activity commited on internet, Using Internet, By the internet. Internet crime is a strong branch of cyber crime. For example:- Internet scam, cyber staking, identity theft.<\/p><h3>Category of the Cyber Crime<\/h3><p>There are three major categories that cybercrime falls into: individual, property and government.&nbsp;<\/p><ul><li><strong>Individual:<\/strong> This category of cybercrime involves one individual distributing malicious or illegal information online. This can include cyber stalking, distributing pornography and trafficking.<\/li><li><strong>Property:<\/strong> criminal illegally using an individual’s bank or credit card details. The hacker steals a person’s bank details to gain access to funds, make purchases online or run phishing scams to get people to give away their information.&nbsp;<\/li><li><strong>Government:<\/strong> This is the least common cybercrime, but is the most serious offense. A crime against the government is also known as cyber terrorism. Government cybercrime includes hacking government websites, military websites or distributing propaganda<\/li><\/ul><h3>Cyber Crime under IPC.<\/h3><p>There are many section in Indian Panel Code. Reads these Section before doing Cyber Crime.<\/p><h4>Section 425 Mischief<\/h4><p>Whoever with intent to cause, or knowing that he is likely to cause, wrongful loss or damage to the public or to any person, cause the destruction of any property, or any such change in any property or in the situation thereof as destroys or diminishes its value or utility, or affects it injuriously, commits \"mischief\".<\/p><p>Damaging Computer System of Someone will fall within Section 425 of IPC. The Punishment &nbsp;of Mischief is imprisonment &nbsp;up to three months or fine or both.<\/p><h4>Section 379 Theft<\/h4><p>Data of any individual or any organization in any form &nbsp;is stolen &nbsp;by someone will fall under Section 379 of IPC. Punishment of imprisonment of three years or fine or both.<\/p><h4>Section 319 &amp; 320 Cheating<\/h4><p>If a Password is stolen and used by someone for fraudulent purpose, Send mail for fraudulent purpose or create bogus, phishing website, or do cyber fraud &nbsp;will be punished up to imprisonment of three years or &nbsp;under section 319 and imprisonment of 5] five years under section 320.<\/p><p>&nbsp;<\/p><p>&nbsp;<\/p><p>&nbsp;<\/p><p>&nbsp;<\/p><p>&nbsp;<\/p>",
    "tags": "Cyber Crime|  Load Metrics (uses 17 credits) KEYWORD types of cyber crime. cyber crime under IPC| Punishment of cyber crime| internet crime",
    "featuredImage": "admin\/images\/1226604226.jpg",
    "url": "http:\/\/sagarbisht.com\/Cyber Security\/What-is-Cyber-Crime-Category-Cyber-Crime-under-IPC-",
    "author": "Sagar Bisht",
    "category": "Cyber Security",
    "location": "",
    "Updatetime": "12-6-2021",
    "description": "Criminal activities done using medium of communication technology, Internet, World wide web and cyber space. It is also known as computer oriented crime. IPC Section 425, 379, 319, 320  deal with Cyber Crime.",
    "slug": "What-is-Cyber-Crime-Category-Cyber-Crime-under-IPC-",
    "keyword": "Cyber Crime,  Load Metrics (uses 17 credits) KEYWORD types of cyber crime. cyber crime under IPC, Punishment of cyber crime, internet crime",
    "image": "admin\/images\/1226604226.jpg",
    "status": "0"
}]}