{"items":[
    {
        "id": "242",
        "title": "What is SSL? How it works.",
        "content": "<p>SSL stands for Secure Socket Layer&nbsp; is encryption based network communication protocol that provides confidentiality integrity and authentication to network communication. SSL is a precursor (ancestor) of a modern TLS encryption used today. SSL encrypts the link between a server and the client to ensure that all data passed between them remains secure from attack.<\/p><p>Originally, data on the Web was transmitted in plaintext that anyone could read if they intercepted the message. For example, if a consumer visited a shopping website, placed an order, and entered their credit card number on the website, that credit card number would travel across the Internet unconcealed.<\/p><p>SSL was created to correct this problem and protect user privacy. By encrypting any data that goes between a user and a web server, SSL ensures that anyone who intercepts the data can only see the encrypted data. The consumer's credit card number is now safe, only visible to the shopping website where they entered it.<\/p><p>SSL works between Application layer and transport layer<\/p><h3><br>SSL Protocols<\/h3><ul><li>Handshake protocol<\/li><li>SSL record protocol<\/li><li>Change-cipher spec protocol<\/li><li>Alert protocol<\/li><\/ul><p><strong>Handshake protocol:- <\/strong>Handshake protocol is responsible for established sessions or connection. This&nbsp; protocol allows the client to authenticate the server and the server to authenticate the client.<\/p><p><strong>SSL record protocol:- <\/strong>This protocol provides to services to SSL connection<\/p><ul><li>Confidentiality<\/li><li>Message Integrity<\/li><\/ul><p>&nbsp;SSL Record Protocol gets data from the application layer and is divided&nbsp; into fragments. The fragment is compressed and then encrypted MAC (Message Authentication Code) generated by algorithms like SHA (Secure Hash Protocol) and MD5 (Message Digest). After that encryption of the data is done SSL header is appended to the data.<\/p><p><strong>Change-cipher spec protocol:-<\/strong>This protocol uses SSL record protocol. Basically, Handshake protocol and SSL record protocol work at the same time. So, Until handshake protocol finished his work, SSL record output remained in pending state. &nbsp; After Handshake protocol work is done, Change-cipher spec Protocol causes the pending state to be copied into the current state. This protocol consists of a single (one) message of 1 byte and has only one value.<\/p><p><br><strong>Alert Protocol:- <\/strong>This protocol is responsible for conveying SSL-related alerts to the peer entity. For example:- Error message, Fatal Error etc.<\/p><p><br>&nbsp;<\/p><p><br>&nbsp;<\/p>",
        "tags": "what is ssl| ssl protocol| how ssl work|  what is secure socket layer",
        "featuredImage": "admin\/images\/500242779.png",
        "url": "http:\/\/sagarbisht.com\/Cyber Security\/What-is-SSL-How-it-works-",
        "author": "Sagar Bisht",
        "category": "Cyber Security",
        "location": "",
        "Updatetime": "5-6-2021",
        "description": "SSL stands for Secure Socket Layer  is encryption based network communication protocol that provides confidentiality integrity and authentication to network communication. A website that implements SSL\/TLS has HTTPS in its URL instead of HTTP.",
        "slug": "What-is-SSL-How-it-works-",
        "keyword": "what is ssl, ssl protocol, how ssl work,  what is secure socket layer",
        "image": "admin\/images\/500242779.png",
        "status": "0"
    },
    {
        "id": "241",
        "title": "What is SSH (Secure Shell) and  How does it Work?",
        "content": "<p><strong>SSH <\/strong>or<strong> Secure Shell<\/strong> &nbsp;also known as <strong>SSH Protocol<\/strong> is a network protocol that give user, particularly system administrator &nbsp;a secure way to operating network services over an unsecured network. Or it is a remote network protocol to &nbsp;control remote servers over the internet. Secure communication provides a strong password authentication and encrypted communication in a insecure channel. &nbsp;SSH uses<a href=\"https:\/\/www.geeksforgeeks.org\/cryptography-and-its-types\/\"> cryptography<\/a> technology to ensure all communication in an encrypted manner &nbsp;between the host and the client. Host refers to the remote server you are trying to access, while the client is the computer you are using to access the host. Basically, SSH client is an software program which uses the secure shell protocol to connect to a remote server. SSH is widely used by network administrators for managing there remote system and application , enabling them to log in to another computer over a network, execute commands and move files from one computer to another. The first version of SSH &nbsp;was SSH-1 appeared in 1995 designed by Tatu Ylönen, a researcher at Helsinki University of Technology that &nbsp;now considered to be deprecated and not safe to use. The current version of Secure Shell protocols is SSH-2, &nbsp;that was adopted as a Standards Track specification by the Internet Engineering Task Force (IETF) in 2006. This algorithm allows client and the server to arrive at a shared encryption key which will be used &nbsp;to encrypt the entire communication session.<\/p><p>Suppose you want to send a Message to one of your friends. Without SSH, it can be opened and read by middle man(attacker). But if you will send it using SSH protocol, it will be encrypted and secured with the public key of the receiver, and only the receiver can open it using its private key.<\/p><p>There are three different &nbsp;types of encryption technologies used by SSH:<\/p><ol><li>Symmetrical encryption<\/li><li>Asymmetrical encryption<\/li><li>One-way Hashing<\/li><\/ol><h4><strong>Symmetrical Encryption&nbsp;<\/strong><\/h4><p>Symmetrical encryption is a type of encryption where &nbsp;only one key (secrete key) is used for both encryption and decryption. This is also known as<strong> shared key encryption. <\/strong>In this encryption, one problem arise at the time of initial key exchange. if a attacker &nbsp;is present during the key exchange, he could know the key and can use it to decrypt the message. This problem can be solved using Key exchange algorithms like <a href=\"https:\/\/www.geeksforgeeks.org\/implementation-diffie-hellman-algorithm\/\">Diffie-Hellman key exchange<\/a> that use asymmetrical encryption.<\/p><h4><strong>Asymmetrical Encryption<\/strong><\/h4><p>In Asymmetrical encryption , there is a pair of keys- public key and private key, for encryption and decryption. The public key is openly distributed and shared with all parties. The private key is private to the user only and cannot be shared with any other. Public key is saved on SSH server and private key save locally on SSH client. The Message is encrypted using public key and can only decrypted using private key. It is very secure technique, even attacker know the encryption algorithm and public key. He cannot able to decrypt the message until he don't know the private key.<\/p><h4><strong>One-way Hashing<\/strong><\/h4><p><strong>&nbsp;<\/strong>In one way hashing, a hash function is used to generate a unique fixed length of code for each input known as hash code that cannot be exploited. It is &nbsp;impossible to generate the input from the hash. This makes them practically impossible to reverse. I basically use <a href=\"https:\/\/www.geeksforgeeks.org\/what-is-hmachash-based-message-authentication-code\/\">Hash-based Message Authentication Codes or HMAC<\/a> to ensure that messages reached in complete and unmodified form (integrity). Regardless of the data’s size, type, or length, the hash that any data produces is always the same length.&nbsp;<\/p><p>In this technique, &nbsp;Each message will append with MAC (Message authentication code), which will have symmetric key, packet sequence number, and message content. These components form the hash function that generate a uninformative string (encrypted form of message). This string will send to SSH server. SSH server will &nbsp;be have same information, so SSH server also generate the hash function, if the generated hash will be same as received hash. it means message is unmodified (integrity proved).<\/p><h3>How does SSH work?<\/h3><p><strong>SSH client<\/strong> is an software program which uses the secure shell protocol to connect to a remote system. <strong>SSH server<\/strong> is a software program which uses the secure shell protocol to accept connections from remote System (SSH client).<\/p><p>When an SSH client makes a request &nbsp;to access a remote server. Server first authenticates the client. Server will generate the random string and encrypt it using the client public key and will send it to the client. Now, if the client is authentic, it will decrypt the encrypt message sent by the server using its private key. If a client is able to decrypt the encrypted data, it will send acknowledgement(decrypted message) to the server. &nbsp;This is how an SSH client will be authenticated (verified). &nbsp;<\/p><p>After authentication, a secure channel(connection) will be created for the communication. Secure channel means data will transmit in encrypted format and &nbsp;no other third party will be able to access that data.<\/p><p>This is how SSH also provides confidentiality and integrity of data over unsecured networks. Confidentiality means &nbsp;data should be secure from unauthorized view or access and integrity means<\/p><p>In Mac and Linux operating systems, terminals can be used to access SSH. In the window, we will need &nbsp;third party software (SSH client) &nbsp;to establish an SSH connection. The most popular SSH client is PuTTY.<\/p><h3>Architecture Layer of SSH<\/h3><p>The SSH protocol have an open architecture. Hence, other than secure shell, it can be used for many other purposes. The SSH architecture is made-up of three &nbsp;layers:<\/p><ol><li>Transport Layer<\/li><li>User-authentication layer<\/li><li>Connection Layer<\/li><\/ol><h4>Transport Layer<\/h4><p>Transport layer runs on top of TCP\/IP. This layer &nbsp;handle initial key exchange as well as it is responsible for handling server authentication, set up encryption, compression, and integrity verification. It works as an interface for sending and receiving plaintext packets with sizes up to 32, 768bytes.<\/p><h4>User Authentication Layer<\/h4><p>As its name, user authentication layer is responsible for client authentication to the server and provides various authentication methods. When SSH client is prompt for a password. That password is basically for client authentication, not for server. The server merely responds to the client's authentication requests.<\/p><h4>Connection Layer<\/h4><p>This layer is responsible for defining the concept of channels, channel requests and global requests through which SSH services are provided. At a same time, A single SSH can host multiple channels , and can transfer data in both directions. The connection layer multiplexes the encrypted tunnel into several logical channels.<\/p><p>SSH was designed as a replacement for Telnet and for unsecured remote shell protocols such FTP. Those protocols send information, passwords in plaintext which make them unsecured. SSH organizes the secure connection by authenticating the client and opening the correct shell environment if the verification is successful. SSH operates on Transmission Control Protocol TCP port 22 by default (it can be changed) and uses client server architecture. SSH uses the asymmetric key cryptography to authenticate the client.<\/p><p>SSH can be used to:-<\/p><ul><li>Secure remote access to resources.<\/li><li>Remote execution of commands on host machine.<\/li><li>Delivery of software patches and updates.<\/li><li>Interactive and automated file transfers between local machine and remote server.<\/li><li>For forwarding a port.<\/li><li>By using SSH, we can set up the automatic login to a remote server such as OpenSSH.<\/li><\/ul><p>The SSH protocol protects the network from various attacks such as IP source routing, IP spoofing and DNS spoofing. Today, the protocol is used for managing &nbsp;more than &nbsp;half of world’s web servers . Cyber security specialists and system administrators use it to configure, manage, maintain, and operate &nbsp;firewalls, routers, switches, and servers in the millions of critical networks and environments of our digital world. It is also used inside many file transfer and systems management solutions. Yet there is no known exploitable &nbsp;vulnerabilities in SSH-2 . But information leaked by <a href=\"https:\/\/en.wikipedia.org\/wiki\/Edward_Snowden\">Edward Snowden<\/a> in 2013 when he was an employee at Central Intelligence Agency (CIA). He suggested the National Security Agency &nbsp;may be able to decrypt some SSH traffic.&nbsp;<\/p>",
        "tags": "SSH| what is SSH| Secure Shell| How to use SSH| How SSH work| Network Protocal",
        "featuredImage": "admin\/images\/1337648915.png",
        "url": "http:\/\/sagarbisht.com\/Cyber Security\/What-is-SSH-Secure-Shell-and-How-does-it-Work-",
        "author": "Sagar Bisht",
        "category": "Cyber Security",
        "location": "",
        "Updatetime": "4-6-2021",
        "description": "SSH is a network protocol for operating network services over an unsecured network. Or it is a remote network protocol to  control remote servers over the internet.",
        "slug": "What-is-SSH-Secure-Shell-and-How-does-it-Work-",
        "keyword": "SSH, what is SSH, Secure Shell, How to use SSH, How SSH work, Network Protocal",
        "image": "admin\/images\/1337648915.png",
        "status": "0"
    },
    {
        "id": "240",
        "title": "Finally!  Wait is over. Window 11 is here ",
        "content": "<p>After six years of waiting&nbsp; during which Windows 10 remained largely unchanged, the world’s most popular desktop operating system company Microsoft launched Windows 11.Despite Microsoft proclaiming Window 10 as the <i>last<\/i> version of Windows. But: After a couple years of ho-hum updates, the Windows-using world—at least some of it—has something to get excited about. That said, when we first ran Windows 11 we were surprised that it still wasn’t <i>that <\/i>different from Windows 10, despite its very new look. Not as much as we'd expected it to be, based on the screenshots we'd seen. Sure, it looks nicer with rounded corners for all windows, the taskbar icons in the middle, and more elegant Settings dialogs, but it didn’t feel totally alien or require a whole new process the way Windows 8 did.<\/p><figure class=\"image\"><img src=\"https:\/\/sagarbisht.com\/images\/images\/files\/window11.png\"><\/figure><p>&nbsp;<\/p><p>That out of the way, let’s take a look at what’s new in Windows 11. Much of the work is interface redesign rather than actual features, and—as I mentioned above—Windows 11 is more familiar than you may expect, despite some rearranging and updating the furniture. It borrows from Chrome OS, though the desktop still offers app icons, which Google’s lightweight desktop OS does not. Windowing and multitasking are still far more advanced in Windows, too. The interface gets macOS’s rounded corners for all windows, which is not really a significant change, but does give the OS a softer look. Much of the new design brings a welcome new slickness and consistency to the Windows interface, but there are a couple changes of which I’m not a fan.<\/p><p><br>&nbsp;<\/p><p><strong>Requirements<\/strong><\/p><p>Much has been made over the system requirements for Windows 11, but they’re actually very low—1GHz CPU, 4GB RAM, and 64GB storage. You’ll also need a computer with a TPM security chip and Secure Boot capability. Those are less of a problem than the internet is making them out to be, as they’ve been standard on most PCs for the last six or so years. The real limiter will be the CPU model, which needs to be from about the last four years.<\/p><p>If you’re already enrolled in the Windows Insider program and have been receiving Dev channel builds of Windows 10, the requirements are less stringent: I’ve been enrolled in the program, so I was able to install Windows 11 on a 7th-generation Intel Core i5 processor even though the requirements say you need an 8th gen model.<\/p><p>Anyone with one of the newer chips should have no trouble installing Windows 11 via the Insider program. Outside of the Insider Program, the latest word is that standard upgrades to Windows 11 from Windows 10 won’t be available until 2022. My take is that Microsoft really doesn’t want users to upgrade to Windows 11—it wants them to buy new PCs.<\/p><p><br>&nbsp;<\/p>",
        "tags": "window 11| window 11 requirement| microsoft",
        "featuredImage": "admin\/images\/715357580.png",
        "url": "http:\/\/sagarbisht.com\/OperatingSystem\/Finally-Wait-is-over-Window-11-is-here-",
        "author": "Sagar Bisht",
        "category": "OperatingSystem",
        "location": "",
        "Updatetime": "3-6-2021",
        "description": "After six year of waiting, Microsoft launched its hots product. Window 11 is here ",
        "slug": "Finally-Wait-is-over-Window-11-is-here-",
        "keyword": "window 11, window 11 requirement, microsoft",
        "image": "admin\/images\/715357580.png",
        "status": "0"
    },
    {
        "id": "239",
        "title": "What is brute force attack? How to protect against it.",
        "content": "<p>A brute force&nbsp; is the most popular and most easy attack. The most common use of brute force attacks are cracking passwords and cracking encryption keys .&nbsp; In this attack, attackers try every combination of characters until they are not able to crack the system password. Basically, it is a guessing technique.<\/p><p>Let suppose, attacker knows that the password contains only 6 numbers&nbsp; from 0 to 6. So, they will try all the combinations.&nbsp; for example, 134562,456324,543261 etc. There can only be 2^n combinations&nbsp; where n is numbers of characters&nbsp; and one of them can be a password.<\/p><h4>There are many software available that can perform brute force attack, some of them are:-<\/h4><ul><li>Aircrack-ng<\/li><li>Dave Grohl<\/li><li>John the ripper<\/li><li>Cain and Abel<\/li><li>Hashcat<\/li><li>Rainbowcrack<\/li><li>Crack<\/li><li>Hydra<\/li><li>Ophcrack<\/li><\/ul><h3>What are the strengths and weaknesses of brute force attack?<\/h3><p>The biggest advantage of the brute force attack is , it is very simple to perform. Even if the attacker doesn't have prior knowledge of security networking etc. They can also perform the brute force attack using&nbsp; available software. Also, passwords are just combinations of character and&nbsp; symbols, that's why&nbsp; every password based system and encryption key can be cracked using brute force attack, but may take&nbsp; too much time .&nbsp;<\/p><p>On the other hand, brute force attacks are very slow. As they may have to run every possible combination of characters to crack the password or key. If the target string is long, it will take more time, then it could take brute force attackers days, months or years to crack the password.<\/p><h3><br><strong>How to protect against brute force attacks?<\/strong><\/h3><p>Developers&nbsp; can introduce a two factor&nbsp; authentication&nbsp; system&nbsp; or the invalid login attempt limit. System should block or delay the&nbsp; authentication request ( password verify ), if too many&nbsp; invalid&nbsp; requests are made from a particular IP (user).<\/p><p>Another option is to introduce Captcha. Captcha&nbsp; stands for Completely Automated Public testing&nbsp; to tell Computers and Humans apart. It is a challenge-response test used to determine whether or not&nbsp; the user is human. Captcha provides a challenge which is difficult for bots\/software to solve but humans can,&nbsp; for example:-&nbsp; sum of a number, identifying&nbsp; the image, clicking on a specific area. There are many types of captcha available. Text-based captcha, Recaptcha, Mathematical captcha, 3d captcha etc.<\/p><p><br>&nbsp;<\/p>",
        "tags": "brute force| brute force attack tools| protect against brute force| brute force software| cyber security",
        "featuredImage": "admin\/images\/1981942672.jpg",
        "url": "http:\/\/sagarbisht.com\/Cyber Security\/What-is-brute-force-attack-How-to-protect-against-it-",
        "author": "Sagar Bisht",
        "category": "Cyber Security",
        "location": "",
        "Updatetime": "28-5-2021",
        "description": "In brute force, attackers try every combination of characters until they are not able to crack the system password. ",
        "slug": "What-is-brute-force-attack-How-to-protect-against-it-",
        "keyword": "brute force, brute force attack tools, protect against brute force, brute force software, cyber security",
        "image": "admin\/images\/1981942672.jpg",
        "status": "0"
    }
]}